Tekla Open API Reference for Tekla Structures 2025
UserPropertyName Class
 The UserPropertyName class contains the name of the user property item.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.UserPropertyName
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class UserPropertyName
Public NotInheritable Class UserPropertyName
The UserPropertyName type exposes the following members.
Constructors
Name | Description
UserPropertyName
Initializes a new instance of the UserPropertyName class
Top
Properties
Name | Description
Name
 The user property item name.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace